<!-- tf-plan-prod -->
### :x: Terraform Plan — `prod`

Plan failed with errors

| Status | Module | Summary |
|--------|--------|---------|
| :construction: | `resource-group` | +1 ~0 -0 |
| :grey_question: | `monitoring` | Plan completed |
| :grey_question: | `database` | Plan completed |
| :grey_question: | `storage` | Plan completed |
| :grey_question: | `container-registry` | Plan completed |
| :grey_question: | `container-apps` | Plan completed |
| :x: | `static-web-app-docs` | Error during plan |

<details>
<summary>Full plan output</summary>

```
21:38:53.527 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./resource-group

Group 2
- Module ./container-registry
- Module ./database
- Module ./monitoring
- Module ./static-web-app-docs
- Module ./storage

Group 3
- Module ./container-apps


21:38:53.725 INFO   [resource-group] Downloading Terraform configurations from ../../../terraform/modules/resource-group into ./resource-group/.terragrunt-cache/LlOfO51pB26hKkHE5u_z5zaUNks/91YhilwHVY0vmuuWkvkfl2QktcE
21:38:53.759 STDOUT [resource-group] terraform: Initializing the backend...
21:38:55.306 STDOUT [resource-group] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:38:55.306 STDOUT [resource-group] terraform: use this backend unless the backend configuration changes.
21:38:56.510 STDOUT [resource-group] terraform: Initializing provider plugins...
21:38:56.510 STDOUT [resource-group] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:38:56.537 STDOUT [resource-group] terraform: - Finding latest version of hashicorp/azuread...
21:38:56.638 STDOUT [resource-group] terraform: - Installing hashicorp/azurerm v4.62.1...
21:38:58.111 STDOUT [resource-group] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:38:58.188 STDOUT [resource-group] terraform: - Installing hashicorp/azuread v3.8.0...
21:38:58.606 STDOUT [resource-group] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:38:58.606 STDOUT [resource-group] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:38:58.606 STDOUT [resource-group] terraform: selections it made above. Include this file in your version control repository
21:38:58.606 STDOUT [resource-group] terraform: so that Terraform can guarantee to make the same selections by default when
21:38:58.606 STDOUT [resource-group] terraform: you run "terraform init" in the future.
21:38:58.607 STDOUT [resource-group] terraform: Terraform has been successfully initialized!
21:38:58.607 STDOUT [resource-group] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:38:58.607 STDOUT [resource-group] terraform: any changes that are required for your infrastructure. All Terraform commands
21:38:58.607 STDOUT [resource-group] terraform: should now work.
21:38:58.607 STDOUT [resource-group] terraform: If you ever set or change modules or backend configuration for Terraform,
21:38:58.607 STDOUT [resource-group] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:38:58.607 STDOUT [resource-group] terraform: commands will detect it and remind you to do so if necessary.
21:39:00.870 STDOUT [resource-group] terraform: Acquiring state lock. This may take a few moments...
21:39:10.048 STDOUT [resource-group] terraform: Terraform used the selected providers to generate the following execution
21:39:10.048 STDOUT [resource-group] terraform: plan. Resource actions are indicated with the following symbols:
21:39:10.048 STDOUT [resource-group] terraform:   + create
21:39:10.048 STDOUT [resource-group] terraform: Terraform will perform the following actions:
21:39:10.048 STDOUT [resource-group] terraform:   # azurerm_resource_group.main will be created
21:39:10.048 STDOUT [resource-group] terraform:   + resource "azurerm_resource_group" "main" {
21:39:10.048 STDOUT [resource-group] terraform:       + id       = (known after apply)
21:39:10.048 STDOUT [resource-group] terraform:       + location = "southafricanorth"
21:39:10.048 STDOUT [resource-group] terraform:       + name     = "rg-chaufher-prod"
21:39:10.048 STDOUT [resource-group] terraform:       + tags     = {
21:39:10.048 STDOUT [resource-group] terraform:           + "costCenter"  = "production"
21:39:10.048 STDOUT [resource-group] terraform:           + "criticality" = "high"
21:39:10.048 STDOUT [resource-group] terraform:           + "environment" = "prod"
21:39:10.048 STDOUT [resource-group] terraform:           + "managedBy"   = "Terragrunt"
21:39:10.048 STDOUT [resource-group] terraform:           + "org"         = "chf"
21:39:10.048 STDOUT [resource-group] terraform:           + "project"     = "ChaufHER"
21:39:10.048 STDOUT [resource-group] terraform:         }
21:39:10.048 STDOUT [resource-group] terraform:     }
21:39:10.048 STDOUT [resource-group] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
21:39:10.048 STDOUT [resource-group] terraform: Changes to Outputs:
21:39:10.048 STDOUT [resource-group] terraform:   + id       = (known after apply)
21:39:10.048 STDOUT [resource-group] terraform:   + location = "southafricanorth"
21:39:10.049 STDOUT [resource-group] terraform:   + name     = "rg-chaufher-prod"
21:39:10.049 STDOUT [resource-group] terraform: ─────────────────────────────────────────────────────────────────────────────
21:39:10.049 STDOUT [resource-group] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
21:39:10.049 STDOUT [resource-group] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
21:39:10.448 STDOUT [resource-group] terraform: Releasing state lock. This may take a few moments...
21:39:13.381 WARN   [container-registry] Config ./resource-group/terragrunt.hcl is a dependency of ./container-registry/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
21:39:13.381 WARN   [database] Config ./resource-group/terragrunt.hcl is a dependency of ./database/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
21:39:13.381 WARN   [static-web-app-docs] Config ./resource-group/terragrunt.hcl is a dependency of ./static-web-app-docs/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
21:39:13.381 WARN   [monitoring] Config ./resource-group/terragrunt.hcl is a dependency of ./monitoring/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
21:39:13.381 WARN   [storage] Config ./resource-group/terragrunt.hcl is a dependency of ./storage/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
21:39:13.393 INFO   [container-registry] Downloading Terraform configurations from ../../../terraform/modules/container-registry into ./container-registry/.terragrunt-cache/WSrvUg2W7LWi7C9rEXbytsmPkEQ/6dP-ebFu_ykPPzxiW9Hwgqygzd4
21:39:13.398 INFO   [static-web-app-docs] Downloading Terraform configurations from ../../../terraform/modules/static-web-app into ./static-web-app-docs/.terragrunt-cache/L0l85Ow2TznIjKPBtpLdd_TV2yc/Vox_oPeYAHk-WOfmjaaUzzoIGdI
21:39:13.400 INFO   [monitoring] Downloading Terraform configurations from ../../../terraform/modules/monitoring into ./monitoring/.terragrunt-cache/gF2bXi6N8QE5zkoDCV5GNeesYjU/Ys1SlQ6tJBYiPrgardGFs0q0yWM
21:39:13.402 INFO   [database] Downloading Terraform configurations from ../../../terraform/modules/database into ./database/.terragrunt-cache/u2fHWZp6fR-b7VLYkcDbCCjxstA/IxRQpDSJ16yiruksTsU6PnHregM
21:39:13.409 INFO   [storage] Downloading Terraform configurations from ../../../terraform/modules/storage into ./storage/.terragrunt-cache/zWC5g-h0VzRW8M3Rl5dTCNu2DHM/FE7Eqfe2vdjB4Va9-rcOBZDAfIQ
21:39:13.441 STDOUT [container-registry] terraform: Initializing the backend...
21:39:13.448 STDOUT [static-web-app-docs] terraform: Initializing the backend...
21:39:13.457 STDOUT [monitoring] terraform: Initializing the backend...
21:39:13.465 STDOUT [database] terraform: Initializing the backend...
21:39:13.468 STDOUT [storage] terraform: Initializing the backend...
21:39:14.821 STDOUT [database] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:39:14.821 STDOUT [database] terraform: use this backend unless the backend configuration changes.
21:39:14.966 STDOUT [static-web-app-docs] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:39:14.966 STDOUT [static-web-app-docs] terraform: use this backend unless the backend configuration changes.
21:39:14.991 STDOUT [container-registry] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:39:14.991 STDOUT [container-registry] terraform: use this backend unless the backend configuration changes.
21:39:15.005 STDOUT [monitoring] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:39:15.005 STDOUT [monitoring] terraform: use this backend unless the backend configuration changes.
21:39:15.043 STDOUT [storage] terraform: Successfully configured the backend "azurerm"! Terraform will automatically
21:39:15.043 STDOUT [storage] terraform: use this backend unless the backend configuration changes.
21:39:16.029 STDOUT [database] terraform: Initializing provider plugins...
21:39:16.029 STDOUT [database] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:39:16.060 STDOUT [database] terraform: - Finding latest version of hashicorp/azuread...
21:39:16.140 STDOUT [database] terraform: - Installing hashicorp/azurerm v4.62.1...
21:39:16.167 STDOUT [static-web-app-docs] terraform: Initializing provider plugins...
21:39:16.167 STDOUT [static-web-app-docs] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:39:16.195 STDOUT [static-web-app-docs] terraform: - Finding latest version of hashicorp/azuread...
21:39:16.202 STDOUT [container-registry] terraform: Initializing provider plugins...
21:39:16.202 STDOUT [container-registry] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:39:16.229 STDOUT [container-registry] terraform: - Finding latest version of hashicorp/azuread...
21:39:16.230 STDOUT [monitoring] terraform: Initializing provider plugins...
21:39:16.230 STDOUT [monitoring] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:39:16.248 STDOUT [storage] terraform: Initializing provider plugins...
21:39:16.248 STDOUT [storage] terraform: - Finding hashicorp/azurerm versions matching "~> 4.0"...
21:39:16.256 STDOUT [monitoring] terraform: - Finding latest version of hashicorp/azuread...
21:39:16.273 STDOUT [storage] terraform: - Finding latest version of hashicorp/azuread...
21:39:16.279 STDOUT [static-web-app-docs] terraform: - Installing hashicorp/azurerm v4.62.1...
21:39:16.338 STDOUT [container-registry] terraform: - Installing hashicorp/azurerm v4.62.1...
21:39:16.338 STDOUT [monitoring] terraform: - Installing hashicorp/azurerm v4.62.1...
21:39:16.399 STDOUT [storage] terraform: - Installing hashicorp/azurerm v4.62.1...
21:39:18.981 STDOUT [storage] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:39:19.060 STDOUT [storage] terraform: - Installing hashicorp/azuread v3.8.0...
21:39:19.153 STDOUT [container-registry] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:39:19.226 STDOUT [container-registry] terraform: - Installing hashicorp/azuread v3.8.0...
21:39:19.374 STDOUT [static-web-app-docs] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:39:19.441 STDOUT [monitoring] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:39:19.456 STDOUT [static-web-app-docs] terraform: - Installing hashicorp/azuread v3.8.0...
21:39:19.535 STDOUT [monitoring] terraform: - Installing hashicorp/azuread v3.8.0...
21:39:19.569 STDOUT [database] terraform: - Installed hashicorp/azurerm v4.62.1 (signed by HashiCorp)
21:39:19.695 STDOUT [database] terraform: - Installing hashicorp/azuread v3.8.0...
21:39:19.737 STDOUT [storage] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:39:19.738 STDOUT [storage] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:39:19.738 STDOUT [storage] terraform: selections it made above. Include this file in your version control repository
21:39:19.738 STDOUT [storage] terraform: so that Terraform can guarantee to make the same selections by default when
21:39:19.739 STDOUT [storage] terraform: you run "terraform init" in the future.
21:39:19.739 STDOUT [storage] terraform: Terraform has been successfully initialized!
21:39:19.739 STDOUT [storage] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:39:19.739 STDOUT [storage] terraform: any changes that are required for your infrastructure. All Terraform commands
21:39:19.740 STDOUT [storage] terraform: should now work.
21:39:19.740 STDOUT [storage] terraform: If you ever set or change modules or backend configuration for Terraform,
21:39:19.740 STDOUT [storage] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:39:19.740 STDOUT [storage] terraform: commands will detect it and remind you to do so if necessary.
21:39:20.174 STDOUT [static-web-app-docs] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:39:20.174 STDOUT [static-web-app-docs] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:39:20.175 STDOUT [static-web-app-docs] terraform: selections it made above. Include this file in your version control repository
21:39:20.175 STDOUT [static-web-app-docs] terraform: so that Terraform can guarantee to make the same selections by default when
21:39:20.175 STDOUT [static-web-app-docs] terraform: you run "terraform init" in the future.
21:39:20.175 STDOUT [static-web-app-docs] terraform: Terraform has been successfully initialized!
21:39:20.175 STDOUT [static-web-app-docs] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:39:20.176 STDOUT [static-web-app-docs] terraform: any changes that are required for your infrastructure. All Terraform commands
21:39:20.176 STDOUT [static-web-app-docs] terraform: should now work.
21:39:20.176 STDOUT [static-web-app-docs] terraform: If you ever set or change modules or backend configuration for Terraform,
21:39:20.176 STDOUT [static-web-app-docs] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:39:20.176 STDOUT [static-web-app-docs] terraform: commands will detect it and remind you to do so if necessary.
21:39:20.193 STDOUT [container-registry] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:39:20.193 STDOUT [container-registry] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:39:20.193 STDOUT [container-registry] terraform: selections it made above. Include this file in your version control repository
21:39:20.193 STDOUT [container-registry] terraform: so that Terraform can guarantee to make the same selections by default when
21:39:20.193 STDOUT [container-registry] terraform: you run "terraform init" in the future.
21:39:20.194 STDOUT [container-registry] terraform: Terraform has been successfully initialized!
21:39:20.194 STDOUT [container-registry] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:39:20.194 STDOUT [container-registry] terraform: any changes that are required for your infrastructure. All Terraform commands
21:39:20.194 STDOUT [container-registry] terraform: should now work.
21:39:20.194 STDOUT [container-registry] terraform: If you ever set or change modules or backend configuration for Terraform,
21:39:20.194 STDOUT [container-registry] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:39:20.194 STDOUT [container-registry] terraform: commands will detect it and remind you to do so if necessary.
21:39:20.321 STDOUT [monitoring] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:39:20.322 STDOUT [monitoring] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:39:20.322 STDOUT [monitoring] terraform: selections it made above. Include this file in your version control repository
21:39:20.322 STDOUT [monitoring] terraform: so that Terraform can guarantee to make the same selections by default when
21:39:20.322 STDOUT [monitoring] terraform: you run "terraform init" in the future.
21:39:20.322 STDOUT [monitoring] terraform: Terraform has been successfully initialized!
21:39:20.322 STDOUT [monitoring] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:39:20.322 STDOUT [monitoring] terraform: any changes that are required for your infrastructure. All Terraform commands
21:39:20.322 STDOUT [monitoring] terraform: should now work.
21:39:20.322 STDOUT [monitoring] terraform: If you ever set or change modules or backend configuration for Terraform,
21:39:20.323 STDOUT [monitoring] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:39:20.323 STDOUT [monitoring] terraform: commands will detect it and remind you to do so if necessary.
21:39:20.418 STDOUT [database] terraform: - Installed hashicorp/azuread v3.8.0 (signed by HashiCorp)
21:39:20.418 STDOUT [database] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
21:39:20.419 STDOUT [database] terraform: selections it made above. Include this file in your version control repository
21:39:20.419 STDOUT [database] terraform: so that Terraform can guarantee to make the same selections by default when
21:39:20.419 STDOUT [database] terraform: you run "terraform init" in the future.
21:39:20.419 STDOUT [database] terraform: Terraform has been successfully initialized!
21:39:20.419 STDOUT [database] terraform: You may now begin working with Terraform. Try running "terraform plan" to see
21:39:20.420 STDOUT [database] terraform: any changes that are required for your infrastructure. All Terraform commands
21:39:20.420 STDOUT [database] terraform: should now work.
21:39:20.420 STDOUT [database] terraform: If you ever set or change modules or backend configuration for Terraform,
21:39:20.420 STDOUT [database] terraform: rerun this command to reinitialize your working directory. If you forget, other
21:39:20.420 STDOUT [database] terraform: commands will detect it and remind you to do so if necessary.
21:39:22.247 STDOUT [storage] terraform: Acquiring state lock. This may take a few moments...
21:39:22.331 STDOUT [container-registry] terraform: Acquiring state lock. This may take a few moments...
21:39:22.519 STDOUT [database] terraform: Acquiring state lock. This may take a few moments...
21:39:22.569 STDOUT [static-web-app-docs] terraform: Acquiring state lock. This may take a few moments...
21:39:22.803 STDOUT [monitoring] terraform: Acquiring state lock. This may take a few moments...
21:39:23.777 STDOUT [static-web-app-docs] terraform: Releasing state lock. This may take a few moments...
21:39:24.354 STDERR [static-web-app-docs] terraform: Error: No value for required variable
21:39:24.354 STDERR [static-web-app-docs] terraform:   on variables.tf line 40:
21:39:24.355 STDERR [static-web-app-docs] terraform:   40: variable "workflow_role_definition_name" {
21:39:24.355 STDERR [static-web-app-docs] terraform: The root module input variable "workflow_role_definition_name" is not set,
21:39:24.355 STDERR [static-web-app-docs] terraform: and has no default value. Use a -var or -var-file command line argument to
21:39:24.355 STDERR [static-web-app-docs] terraform: provide a value for this variable.
21:39:24.356 ERROR  [static-web-app-docs] terraform invocation failed in ./static-web-app-docs/.terragrunt-cache/L0l85Ow2TznIjKPBtpLdd_TV2yc/Vox_oPeYAHk-WOfmjaaUzzoIGdI
21:39:24.356 ERROR  [static-web-app-docs] Module ./static-web-app-docs has finished with an error
21:39:31.591 STDOUT [storage] terraform: Terraform used the selected providers to generate the following execution
21:39:31.591 STDOUT [storage] terraform: plan. Resource actions are indicated with the following symbols:
21:39:31.591 STDOUT [storage] terraform:   + create
21:39:31.591 STDOUT [storage] terraform: Terraform will perform the following actions:
21:39:31.592 STDOUT [storage] terraform:   # azurerm_storage_account.main will be created
21:39:31.592 STDOUT [storage] terraform:   + resource "azurerm_storage_account" "main" {
21:39:31.592 STDOUT [storage] terraform:       + access_tier                        = "Hot"
21:39:31.592 STDOUT [storage] terraform:       + account_kind                       = "StorageV2"
21:39:31.592 STDOUT [storage] terraform:       + account_replication_type           = "GRS"
21:39:31.592 STDOUT [storage] terraform:       + account_tier                       = "Standard"
21:39:31.592 STDOUT [storage] terraform:       + allow_nested_items_to_be_public    = false
21:39:31.592 STDOUT [storage] terraform:       + cross_tenant_replication_enabled   = false
21:39:31.592 STDOUT [storage] terraform:       + default_to_oauth_authentication    = false
21:39:31.593 STDOUT [storage] terraform:       + dns_endpoint_type                  = "Standard"
21:39:31.593 STDOUT [storage] terraform:       + https_traffic_only_enabled         = true
21:39:31.593 STDOUT [storage] terraform:       + id                                 = (known after apply)
21:39:31.593 STDOUT [storage] terraform:       + infrastructure_encryption_enabled  = true
21:39:31.593 STDOUT [storage] terraform:       + is_hns_enabled                     = false
21:39:31.593 STDOUT [storage] terraform:       + large_file_share_enabled           = (known after apply)
21:39:31.593 STDOUT [storage] terraform:       + local_user_enabled                 = true
21:39:31.593 STDOUT [storage] terraform:       + location                           = "southafricanorth"
21:39:31.593 STDOUT [storage] terraform:       + min_tls_version                    = "TLS1_2"
21:39:31.593 STDOUT [storage] terraform:       + name                               = "chfprodstorprod"
21:39:31.593 STDOUT [storage] terraform:       + nfsv3_enabled                      = false
21:39:31.593 STDOUT [storage] terraform:       + primary_access_key                 = (sensitive value)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_connection_string     = (sensitive value)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_endpoint              = (known after apply)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_host                  = (known after apply)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_internet_endpoint     = (known after apply)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_internet_host         = (known after apply)
21:39:31.594 STDOUT [storage] terraform:       + primary_blob_microsoft_endpoint    = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_blob_microsoft_host        = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_connection_string          = (sensitive value)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_endpoint               = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_host                   = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_internet_endpoint      = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_internet_host          = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_microsoft_endpoint     = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_dfs_microsoft_host         = (known after apply)
21:39:31.595 STDOUT [storage] terraform:       + primary_file_endpoint              = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_file_host                  = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_file_internet_endpoint     = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_file_internet_host         = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_file_microsoft_endpoint    = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_file_microsoft_host        = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_location                   = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_queue_endpoint             = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_queue_host                 = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_queue_microsoft_endpoint   = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_queue_microsoft_host       = (known after apply)
21:39:31.596 STDOUT [storage] terraform:       + primary_table_endpoint             = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_table_host                 = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_table_microsoft_endpoint   = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_table_microsoft_host       = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_endpoint               = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_host                   = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_internet_endpoint      = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_internet_host          = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_microsoft_endpoint     = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + primary_web_microsoft_host         = (known after apply)
21:39:31.597 STDOUT [storage] terraform:       + public_network_access_enabled      = false
21:39:31.597 STDOUT [storage] terraform:       + queue_encryption_key_type          = "Service"
21:39:31.597 STDOUT [storage] terraform:       + resource_group_name                = "rg-mock"
21:39:31.597 STDOUT [storage] terraform:       + secondary_access_key               = (sensitive value)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_connection_string   = (sensitive value)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_endpoint            = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_host                = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_internet_endpoint   = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_internet_host       = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_microsoft_endpoint  = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_blob_microsoft_host      = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_connection_string        = (sensitive value)
21:39:31.598 STDOUT [storage] terraform:       + secondary_dfs_endpoint             = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_dfs_host                 = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_dfs_internet_endpoint    = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_dfs_internet_host        = (known after apply)
21:39:31.598 STDOUT [storage] terraform:       + secondary_dfs_microsoft_endpoint   = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_dfs_microsoft_host       = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_endpoint            = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_host                = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_internet_endpoint   = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_internet_host       = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_microsoft_endpoint  = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_file_microsoft_host      = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_location                 = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_queue_endpoint           = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_queue_host               = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_queue_microsoft_endpoint = (known after apply)
21:39:31.599 STDOUT [storage] terraform:       + secondary_queue_microsoft_host     = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_table_endpoint           = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_table_host               = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_table_microsoft_endpoint = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_table_microsoft_host     = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_endpoint             = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_host                 = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_internet_endpoint    = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_internet_host        = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_microsoft_endpoint   = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + secondary_web_microsoft_host       = (known after apply)
21:39:31.600 STDOUT [storage] terraform:       + sftp_enabled                       = false
21:39:31.600 STDOUT [storage] terraform:       + shared_access_key_enabled          = false
21:39:31.600 STDOUT [storage] terraform:       + table_encryption_key_type          = "Service"
21:39:31.600 STDOUT [storage] terraform:       + tags                               = {
21:39:31.601 STDOUT [storage] terraform:           + "costCenter"  = "production"
21:39:31.601 STDOUT [storage] terraform:           + "criticality" = "high"
21:39:31.601 STDOUT [storage] terraform:           + "environment" = "prod"
21:39:31.601 STDOUT [storage] terraform:           + "managedBy"   = "Terragrunt"
21:39:31.601 STDOUT [storage] terraform:           + "org"         = "chf"
21:39:31.601 STDOUT [storage] terraform:           + "project"     = "ChaufHER"
21:39:31.601 STDOUT [storage] terraform:         }
21:39:31.601 STDOUT [storage] terraform:       + blob_properties {
21:39:31.601 STDOUT [storage] terraform:           + change_feed_enabled      = false
21:39:31.601 STDOUT [storage] terraform:           + default_service_version  = (known after apply)
21:39:31.601 STDOUT [storage] terraform:           + last_access_time_enabled = false
21:39:31.601 STDOUT [storage] terraform:           + versioning_enabled       = true
21:39:31.601 STDOUT [storage] terraform:           + container_delete_retention_policy {
21:39:31.601 STDOUT [storage] terraform:               + days = 7
21:39:31.601 STDOUT [storage] terraform:             }
21:39:31.601 STDOUT [storage] terraform:           + delete_retention_policy {
21:39:31.601 STDOUT [storage] terraform:               + days                     = 7
21:39:31.601 STDOUT [storage] terraform:               + permanent_delete_enabled = false
21:39:31.601 STDOUT [storage] terraform:             }
21:39:31.601 STDOUT [storage] terraform:         }
21:39:31.601 STDOUT [storage] terraform:       + network_rules {
21:39:31.601 STDOUT [storage] terraform:           + bypass                     = [
21:39:31.601 STDOUT [storage] terraform:               + "AzureServices",
21:39:31.601 STDOUT [storage] terraform:               + "Logging",
21:39:31.601 STDOUT [storage] terraform:               + "Metrics",
21:39:31.601 STDOUT [storage] terraform:             ]
21:39:31.601 STDOUT [storage] terraform:           + default_action             = "Deny"
21:39:31.602 STDOUT [storage] terraform:           + ip_rules                   = (known after apply)
21:39:31.602 STDOUT [storage] terraform:           + virtual_network_subnet_ids = (known after apply)
21:39:31.602 STDOUT [storage] terraform:         }
21:39:31.602 STDOUT [storage] terraform:       + queue_properties {
21:39:31.602 STDOUT [storage] terraform:           + hour_metrics (known after apply)
21:39:31.602 STDOUT [storage] terraform:           + logging {
21:39:31.602 STDOUT [storage] terraform:               + delete                = true
21:39:31.602 STDOUT [storage] terraform:               + read                  = true
21:39:31.602 STDOUT [storage] terraform:               + retention_policy_days = 30
21:39:31.602 STDOUT [storage] terraform:               + version               = "1.0"
21:39:31.602 STDOUT [storage] terraform:               + write                 = true
21:39:31.602 STDOUT [storage] terraform:             }
21:39:31.602 STDOUT [storage] terraform:           + minute_metrics (known after apply)
21:39:31.602 STDOUT [storage] terraform:         }
21:39:31.602 STDOUT [storage] terraform:       + routing (known after apply)
21:39:31.602 STDOUT [storage] terraform:       + sas_policy {
21:39:31.602 STDOUT [storage] terraform:           + expiration_action = "Log"
21:39:31.602 STDOUT [storage] terraform:           + expiration_period = "00.01:00:00"
21:39:31.602 STDOUT [storage] terraform:         }
21:39:31.602 STDOUT [storage] terraform:       + share_properties (known after apply)
21:39:31.602 STDOUT [storage] terraform:       + static_website (known after apply)
21:39:31.602 STDOUT [storage] terraform:     }
21:39:31.602 STDOUT [storage] terraform:   # azurerm_storage_container.documents will be created
21:39:31.602 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "documents" {
21:39:31.603 STDOUT [storage] terraform:       + container_access_type             = "private"
21:39:31.603 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
21:39:31.603 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + id                                = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + metadata                          = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + name                              = "documents"
21:39:31.603 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
21:39:31.603 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
21:39:31.603 STDOUT [storage] terraform:     }
21:39:31.603 STDOUT [storage] terraform:   # azurerm_storage_container.profiles will be created
21:39:31.603 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "profiles" {
21:39:31.603 STDOUT [storage] terraform:       + container_access_type             = "private"
21:39:31.603 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
21:39:31.604 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + id                                = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + metadata                          = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + name                              = "profiles"
21:39:31.604 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
21:39:31.604 STDOUT [storage] terraform:     }
21:39:31.604 STDOUT [storage] terraform:   # azurerm_storage_container.trips will be created
21:39:31.604 STDOUT [storage] terraform:   + resource "azurerm_storage_container" "trips" {
21:39:31.604 STDOUT [storage] terraform:       + container_access_type             = "private"
21:39:31.604 STDOUT [storage] terraform:       + default_encryption_scope          = (known after apply)
21:39:31.604 STDOUT [storage] terraform:       + encryption_scope_override_enabled = true
21:39:31.604 STDOUT [storage] terraform:       + has_immutability_policy           = (known after apply)
21:39:31.605 STDOUT [storage] terraform:       + has_legal_hold                    = (known after apply)
21:39:31.605 STDOUT [storage] terraform:       + id                                = (known after apply)
21:39:31.605 STDOUT [storage] terraform:       + metadata                          = (known after apply)
21:39:31.605 STDOUT [storage] terraform:       + name                              = "trips"
21:39:31.605 STDOUT [storage] terraform:       + resource_manager_id               = (known after apply)
21:39:31.605 STDOUT [storage] terraform:       + storage_account_id                = (known after apply)
21:39:31.605 STDOUT [storage] terraform:     }
21:39:31.605 STDOUT [storage] terraform: Plan: 4 to add, 0 to change, 0 to destroy.
21:39:31.605 STDOUT [storage] terraform: Changes to Outputs:
21:39:31.605 STDOUT [storage] terraform:   + documents_container_name  = "documents"
21:39:31.605 STDOUT [storage] terraform:   + primary_access_key        = (sensitive value)
21:39:31.605 STDOUT [storage] terraform:   + primary_blob_endpoint     = (known after apply)
21:39:31.605 STDOUT [storage] terraform:   + primary_connection_string = (sensitive value)
21:39:31.605 STDOUT [storage] terraform:   + profiles_container_name   = "profiles"
21:39:31.605 STDOUT [storage] terraform:   + storage_account_id        = (known after apply)
21:39:31.605 STDOUT [storage] terraform:   + storage_account_name      = "chfprodstorprod"
21:39:31.605 STDOUT [storage] terraform:   + trips_container_name      = "trips"
21:39:31.605 STDOUT [storage] terraform: Warning: Argument is deprecated
21:39:31.605 STDOUT [storage] terraform:   with azurerm_storage_account.main,
21:39:31.605 STDOUT [storage] terraform:   on main.tf line 16, in resource "azurerm_storage_account" "main":
21:39:31.606 STDOUT [storage] terraform:   16: resource "azurerm_storage_account" "main" {
21:39:31.606 STDOUT [storage] terraform: this block has been deprecated and superseded by the
21:39:31.606 STDOUT [storage] terraform: `azurerm_storage_account_queue_properties` resource and will be removed in
21:39:31.606 STDOUT [storage] terraform: v5.0 of the AzureRM provider
21:39:31.606 STDOUT [storage] terraform: ─────────────────────────────────────────────────────────────────────────────
21:39:31.606 STDOUT [storage] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
21:39:31.606 STDOUT [storage] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
21:39:31.955 STDOUT [database] terraform: Terraform used the selected providers to generate the following execution
21:39:31.955 STDOUT [database] terraform: plan. Resource actions are indicated with the following symbols:
21:39:31.955 STDOUT [database] terraform:   + create
21:39:31.955 STDOUT [database] terraform: Terraform will perform the following actions:
21:39:31.955 STDOUT [database] terraform:   # azurerm_mssql_database.main will be created
21:39:31.955 STDOUT [database] terraform:   + resource "azurerm_mssql_database" "main" {
21:39:31.955 STDOUT [database] terraform:       + auto_pause_delay_in_minutes                                = (known after apply)
21:39:31.955 STDOUT [database] terraform:       + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
21:39:31.955 STDOUT [database] terraform:       + create_mode                                                = "Default"
21:39:31.955 STDOUT [database] terraform:       + creation_source_database_id                                = (known after apply)
21:39:31.955 STDOUT [database] terraform:       + enclave_type                                               = (known after apply)
21:39:31.955 STDOUT [database] terraform:       + geo_backup_enabled                                         = true
21:39:31.955 STDOUT [database] terraform:       + id                                                         = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + ledger_enabled                                             = true
21:39:31.956 STDOUT [database] terraform:       + license_type                                               = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + maintenance_configuration_name                             = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + max_size_gb                                                = 250
21:39:31.956 STDOUT [database] terraform:       + min_capacity                                               = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + name                                                       = "chf-prod-db-prod"
21:39:31.956 STDOUT [database] terraform:       + read_replica_count                                         = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + read_scale                                                 = (known after apply)
21:39:31.956 STDOUT [database] terraform:       + restore_point_in_time                                      = (known after apply)
21:39:31.957 STDOUT [database] terraform:       + sample_name                                                = (known after apply)
21:39:31.957 STDOUT [database] terraform:       + secondary_type                                             = (known after apply)
21:39:31.959 STDOUT [database] terraform:       + server_id                                                  = (known after apply)
21:39:31.959 STDOUT [database] terraform:       + sku_name                                                   = "S2"
21:39:31.959 STDOUT [database] terraform:       + storage_account_type                                       = "Geo"
21:39:31.959 STDOUT [database] terraform:       + tags                                                       = {
21:39:31.960 STDOUT [database] terraform:           + "costCenter"  = "production"
21:39:31.960 STDOUT [database] terraform:           + "criticality" = "high"
21:39:31.960 STDOUT [database] terraform:           + "environment" = "prod"
21:39:31.960 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
21:39:31.960 STDOUT [database] terraform:           + "org"         = "chf"
21:39:31.960 STDOUT [database] terraform:           + "project"     = "ChaufHER"
21:39:31.960 STDOUT [database] terraform:         }
21:39:31.960 STDOUT [database] terraform:       + transparent_data_encryption_enabled                        = true
21:39:31.960 STDOUT [database] terraform:       + transparent_data_encryption_key_automatic_rotation_enabled = false
21:39:31.960 STDOUT [database] terraform:       + zone_redundant                                             = true
21:39:31.960 STDOUT [database] terraform:       + long_term_retention_policy (known after apply)
21:39:31.960 STDOUT [database] terraform:       + short_term_retention_policy (known after apply)
21:39:31.960 STDOUT [database] terraform:       + threat_detection_policy (known after apply)
21:39:31.960 STDOUT [database] terraform:     }
21:39:31.960 STDOUT [database] terraform:   # azurerm_mssql_server.main will be created
21:39:31.960 STDOUT [database] terraform:   + resource "azurerm_mssql_server" "main" {
21:39:31.960 STDOUT [database] terraform:       + administrator_login                      = "chaufheradmin"
21:39:31.960 STDOUT [database] terraform:       + connection_policy                        = "Default"
21:39:31.960 STDOUT [database] terraform:       + express_vulnerability_assessment_enabled = false
21:39:31.960 STDOUT [database] terraform:       + fully_qualified_domain_name              = (known after apply)
21:39:31.960 STDOUT [database] terraform:       + id                                       = (known after apply)
21:39:31.961 STDOUT [database] terraform:       + location                                 = "southafricanorth"
21:39:31.961 STDOUT [database] terraform:       + minimum_tls_version                      = "1.2"
21:39:31.961 STDOUT [database] terraform:       + name                                     = "chf-prod-sql-prod"
21:39:31.961 STDOUT [database] terraform:       + outbound_network_restriction_enabled     = false
21:39:31.961 STDOUT [database] terraform:       + primary_user_assigned_identity_id        = (known after apply)
21:39:31.961 STDOUT [database] terraform:       + public_network_access_enabled            = false
21:39:31.961 STDOUT [database] terraform:       + resource_group_name                      = "rg-mock"
21:39:31.961 STDOUT [database] terraform:       + restorable_dropped_database_ids          = (known after apply)
21:39:31.961 STDOUT [database] terraform:       + tags                                     = {
21:39:31.961 STDOUT [database] terraform:           + "costCenter"  = "production"
21:39:31.961 STDOUT [database] terraform:           + "criticality" = "high"
21:39:31.961 STDOUT [database] terraform:           + "environment" = "prod"
21:39:31.961 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
21:39:31.961 STDOUT [database] terraform:           + "org"         = "chf"
21:39:31.961 STDOUT [database] terraform:           + "project"     = "ChaufHER"
21:39:31.961 STDOUT [database] terraform:         }
21:39:31.961 STDOUT [database] terraform:       + version                                  = "12.0"
21:39:31.961 STDOUT [database] terraform:         # (1 unchanged attribute hidden)
21:39:31.962 STDOUT [database] terraform:     }
21:39:31.962 STDOUT [database] terraform:   # azurerm_redis_cache.main will be created
21:39:31.962 STDOUT [database] terraform:   + resource "azurerm_redis_cache" "main" {
21:39:31.962 STDOUT [database] terraform:       + access_keys_authentication_enabled = true
21:39:31.962 STDOUT [database] terraform:       + capacity                           = 1
21:39:31.962 STDOUT [database] terraform:       + family                             = "P"
21:39:31.962 STDOUT [database] terraform:       + hostname                           = (known after apply)
21:39:31.962 STDOUT [database] terraform:       + id                                 = (known after apply)
21:39:31.962 STDOUT [database] terraform:       + location                           = "southafricanorth"
21:39:31.962 STDOUT [database] terraform:       + minimum_tls_version                = "1.2"
21:39:31.962 STDOUT [database] terraform:       + name                               = "chf-prod-redis-prod"
21:39:31.963 STDOUT [database] terraform:       + non_ssl_port_enabled               = false
21:39:31.964 STDOUT [database] terraform:       + port                               = (known after apply)
21:39:31.964 STDOUT [database] terraform:       + primary_access_key                 = (sensitive value)
21:39:31.964 STDOUT [database] terraform:       + primary_connection_string          = (sensitive value)
21:39:31.964 STDOUT [database] terraform:       + private_static_ip_address          = (known after apply)
21:39:31.964 STDOUT [database] terraform:       + public_network_access_enabled      = false
21:39:31.964 STDOUT [database] terraform:       + redis_version                      = "6"
21:39:31.964 STDOUT [database] terraform:       + replicas_per_master                = 1
21:39:31.964 STDOUT [database] terraform:       + replicas_per_primary               = (known after apply)
21:39:31.964 STDOUT [database] terraform:       + resource_group_name                = "rg-mock"
21:39:31.964 STDOUT [database] terraform:       + secondary_access_key               = (sensitive value)
21:39:31.964 STDOUT [database] terraform:       + secondary_connection_string        = (sensitive value)
21:39:31.964 STDOUT [database] terraform:       + sku_name                           = "Premium"
21:39:31.964 STDOUT [database] terraform:       + ssl_port                           = (known after apply)
21:39:31.964 STDOUT [database] terraform:       + tags                               = {
21:39:31.964 STDOUT [database] terraform:           + "costCenter"  = "production"
21:39:31.964 STDOUT [database] terraform:           + "criticality" = "high"
21:39:31.964 STDOUT [database] terraform:           + "environment" = "prod"
21:39:31.965 STDOUT [database] terraform:           + "managedBy"   = "Terragrunt"
21:39:31.965 STDOUT [database] terraform:           + "org"         = "chf"
21:39:31.965 STDOUT [database] terraform:           + "project"     = "ChaufHER"
21:39:31.965 STDOUT [database] terraform:         }
21:39:31.965 STDOUT [database] terraform:       + zones                              = [
21:39:31.965 STDOUT [database] terraform:           + "1",
21:39:31.965 STDOUT [database] terraform:           + "2",
21:39:31.965 STDOUT [database] terraform:           + "3",
21:39:31.965 STDOUT [database] terraform:         ]
21:39:31.965 STDOUT [database] terraform:       + redis_configuration {
21:39:31.965 STDOUT [database] terraform:           + aof_backup_enabled              = true
21:39:31.965 STDOUT [database] terraform:           + authentication_enabled          = true
21:39:31.965 STDOUT [database] terraform:           + maxclients                      = (known after apply)
21:39:31.965 STDOUT [database] terraform:           + maxfragmentationmemory_reserved = (known after apply)
21:39:31.965 STDOUT [database] terraform:           + maxmemory_delta                 = (known after apply)
21:39:31.965 STDOUT [database] terraform:           + maxmemory_policy                = "volatile-lru"
21:39:31.965 STDOUT [database] terraform:           + maxmemory_reserved              = (known after apply)
21:39:31.965 STDOUT [database] terraform:         }
21:39:31.965 STDOUT [database] terraform:     }
21:39:31.965 STDOUT [database] terraform: Plan: 3 to add, 0 to change, 0 to destroy.
21:39:31.966 STDOUT [database] terraform: Changes to Outputs:
21:39:31.966 STDOUT [database] terraform:   + redis_connection_string  = (sensitive value)
21:39:31.966 STDOUT [database] terraform:   + redis_hostname           = (known after apply)
21:39:31.966 STDOUT [database] terraform:   + redis_primary_access_key = (sensitive value)
21:39:31.966 STDOUT [database] terraform:   + redis_ssl_port           = (known after apply)
21:39:31.966 STDOUT [database] terraform:   + sql_connection_string    = (known after apply)
21:39:31.966 STDOUT [database] terraform:   + sql_database_name        = "chf-prod-db-prod"
21:39:31.966 STDOUT [database] terraform:   + sql_server_fqdn          = (known after apply)
21:39:31.966 STDOUT [database] terraform:   + sql_server_id            = (known after apply)
21:39:31.966 STDOUT [database] terraform: ─────────────────────────────────────────────────────────────────────────────
21:39:31.966 STDOUT [database] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
21:39:31.966 STDOUT [database] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
21:39:31.996 STDOUT [storage] terraform: Releasing state lock. This may take a few moments...
21:39:32.356 STDOUT [database] terraform: Releasing state lock. This may take a few moments...
21:39:32.547 STDOUT [monitoring] terraform: Terraform used the selected providers to generate the following execution
21:39:32.547 STDOUT [monitoring] terraform: plan. Resource actions are indicated with the following symbols:
21:39:32.547 STDOUT [monitoring] terraform:   + create
21:39:32.547 STDOUT [monitoring] terraform: Terraform will perform the following actions:
21:39:32.547 STDOUT [monitoring] terraform:   # azurerm_application_insights.main will be created
21:39:32.547 STDOUT [monitoring] terraform:   + resource "azurerm_application_insights" "main" {
21:39:32.547 STDOUT [monitoring] terraform:       + app_id                              = (known after apply)
21:39:32.548 STDOUT [monitoring] terraform:       + application_type                    = "web"
21:39:32.548 STDOUT [monitoring] terraform:       + connection_string                   = (sensitive value)
21:39:32.548 STDOUT [monitoring] terraform:       + daily_data_cap_in_gb                = 100
21:39:32.548 STDOUT [monitoring] terraform:       + disable_ip_masking                  = false
21:39:32.548 STDOUT [monitoring] terraform:       + force_customer_storage_for_profiler = false
21:39:32.548 STDOUT [monitoring] terraform:       + id                                  = (known after apply)
21:39:32.548 STDOUT [monitoring] terraform:       + instrumentation_key                 = (sensitive value)
21:39:32.548 STDOUT [monitoring] terraform:       + internet_ingestion_enabled          = true
21:39:32.548 STDOUT [monitoring] terraform:       + internet_query_enabled              = true
21:39:32.548 STDOUT [monitoring] terraform:       + local_authentication_disabled       = false
21:39:32.548 STDOUT [monitoring] terraform:       + location                            = "southafricanorth"
21:39:32.548 STDOUT [monitoring] terraform:       + name                                = "chf-prod-insights-prod"
21:39:32.548 STDOUT [monitoring] terraform:       + resource_group_name                 = "rg-mock"
21:39:32.548 STDOUT [monitoring] terraform:       + retention_in_days                   = 90
21:39:32.548 STDOUT [monitoring] terraform:       + sampling_percentage                 = 100
21:39:32.548 STDOUT [monitoring] terraform:       + tags                                = {
21:39:32.548 STDOUT [monitoring] terraform:           + "costCenter"  = "production"
21:39:32.548 STDOUT [monitoring] terraform:           + "criticality" = "high"
21:39:32.548 STDOUT [monitoring] terraform:           + "environment" = "prod"
21:39:32.549 STDOUT [monitoring] terraform:           + "managedBy"   = "Terragrunt"
21:39:32.549 STDOUT [monitoring] terraform:           + "org"         = "chf"
21:39:32.549 STDOUT [monitoring] terraform:           + "project"     = "ChaufHER"
21:39:32.549 STDOUT [monitoring] terraform:         }
21:39:32.549 STDOUT [monitoring] terraform:       + workspace_id                        = (known after apply)
21:39:32.549 STDOUT [monitoring] terraform:     }
21:39:32.549 STDOUT [monitoring] terraform:   # azurerm_log_analytics_workspace.main will be created
21:39:32.549 STDOUT [monitoring] terraform:   + resource "azurerm_log_analytics_workspace" "main" {
21:39:32.549 STDOUT [monitoring] terraform:       + allow_resource_only_permissions = true
21:39:32.549 STDOUT [monitoring] terraform:       + daily_quota_gb                  = -1
21:39:32.549 STDOUT [monitoring] terraform:       + id                              = (known after apply)
21:39:32.549 STDOUT [monitoring] terraform:       + internet_ingestion_enabled      = true
21:39:32.549 STDOUT [monitoring] terraform:       + internet_query_enabled          = true
21:39:32.549 STDOUT [monitoring] terraform:       + local_authentication_disabled   = (known after apply)
21:39:32.549 STDOUT [monitoring] terraform:       + local_authentication_enabled    = (known after apply)
21:39:32.549 STDOUT [monitoring] terraform:       + location                        = "southafricanorth"
21:39:32.549 STDOUT [monitoring] terraform:       + name                            = "chf-prod-logs-prod"
21:39:32.549 STDOUT [monitoring] terraform:       + primary_shared_key              = (sensitive value)
21:39:32.549 STDOUT [monitoring] terraform:       + resource_group_name             = "rg-mock"
21:39:32.549 STDOUT [monitoring] terraform:       + retention_in_days               = 90
21:39:32.549 STDOUT [monitoring] terraform:       + secondary_shared_key            = (sensitive value)
21:39:32.549 STDOUT [monitoring] terraform:       + sku                             = "PerGB2018"
21:39:32.549 STDOUT [monitoring] terraform:       + tags                            = {
21:39:32.550 STDOUT [monitoring] terraform:           + "costCenter"  = "production"
21:39:32.550 STDOUT [monitoring] terraform:           + "criticality" = "high"
21:39:32.550 STDOUT [monitoring] terraform:           + "environment" = "prod"
21:39:32.550 STDOUT [monitoring] terraform:           + "managedBy"   = "Terragrunt"
21:39:32.550 STDOUT [monitoring] terraform:           + "org"         = "chf"
21:39:32.550 STDOUT [monitoring] terraform:           + "project"     = "ChaufHER"
21:39:32.550 STDOUT [monitoring] terraform:         }
21:39:32.550 STDOUT [monitoring] terraform:       + workspace_id                    = (known after apply)
21:39:32.550 STDOUT [monitoring] terraform:     }
21:39:32.550 STDOUT [monitoring] terraform: Plan: 2 to add, 0 to change, 0 to destroy.
21:39:32.550 STDOUT [monitoring] terraform: Changes to Outputs:
21:39:32.550 STDOUT [monitoring] terraform:   + app_insights_connection_string             = (sensitive value)
21:39:32.550 STDOUT [monitoring] terraform:   + app_insights_instrumentation_key           = (sensitive value)
21:39:32.551 STDOUT [monitoring] terraform:   + log_analytics_workspace_customer_id        = (known after apply)
21:39:32.551 STDOUT [monitoring] terraform:   + log_analytics_workspace_id                 = (known after apply)
21:39:32.551 STDOUT [monitoring] terraform:   + log_analytics_workspace_primary_shared_key = (sensitive value)
21:39:32.551 STDOUT [monitoring] terraform: ─────────────────────────────────────────────────────────────────────────────
21:39:32.551 STDOUT [monitoring] terraform: Note: You didn't use the -out option to save this plan, so Terraform can't
21:39:32.551 STDOUT [monitoring] terraform: guarantee to take exactly these actions if you run "terraform apply" now.
21:39:32.948 STDOUT [monitoring] terraform: Releasing state lock. This may take a few moments...
21:39:33.955 STDOUT [container-registry] terraform: Terraform used the selected providers to generate the following execution
21:39:33.955 STDOUT [container-registry] terraform: plan. Resource actions are indicated with the following symbols:
21:39:33.955 STDOUT [container-registry] terraform:   + create
21:39:33.955 STDOUT [container-registry] terraform: Terraform will perform the following actions:
21:39:33.955 STDOUT [container-registry] terraform:   # azurerm_container_registry.main will be created
21:39:33.956 STDOUT [container-registry] terraform:   + resource "azurerm_container_registry" "main" {
21:39:33.956 STDOUT [container-registry] terraform:       + admin_enabled                 = false
21:39:33.956 STDOUT [container-registry] terraform:       + admin_password                = (sensitive value)
21:39:33.956 STDOUT [container-registry] terraform:       + admin_username                = (known after apply)
21:39:33.956 STDOUT [container-registry] terraform:       + data_endpoint_enabled         = false
21:39:33.956 STDOUT [container-registry] terraform:       + data_endpoint_host_names      = (known after apply)
21:39:33.956 STDOUT [container-registry] terraform:       + encryption                    = (known after apply)
21:39:33.956 STDOUT [container-registry] ter
```

</details>

<sub>Pusher: @JustAGhosT | Workflow: `Infrastructure Validate` | [Actions](https://github.com/phoenixvc/chaufher/actions/runs/22690533006)</sub>